import streamlit as st
import random

def word(data):

    def play_no():
        col1, col2 ,col3= st.columns([1,1,1])
        with col2:
            st.button('استنتج سورة أخرى', on_click=clearing, key='play_button')
        with col3:
            st.button('لا, شكرا', on_click=stopping, key='no_button')
    
    def clearing():
        for key in st.session_state.keys():
            del st.session_state[key]
    def stopping():
        st.markdown(hide_streamlit_style, unsafe_allow_html=True)
        st.stop()
        
        
    hide_streamlit_style = """

    <style>
    .css-1jc7ptx, .e1ewe7hr3, .viewerBadge_container__1QSob, .styles_viewerBadge__1yB5_, .viewerBadge_link__1S137, .viewerBadge_text__1JaDK{ display: none; } #MainMenu{ visibility: hidden; } footer { visibility: hidden; } header { visibility: hidden; }
    
    
    </style>
    """
    st.markdown(hide_streamlit_style, unsafe_allow_html=True)

    help_text = """
    ادخل حرفا واحدا ثم اضغط إضافة
    اذا كان الحرف ضمن اسم السورة سيظهر الحرف فى مكانه الصحيح

    """
    
   

    st.markdown(
    """
    <style>
    div[data-baseweb="tooltip"] {
        background-color: black !important;
        #color: red;
        font-size: 10px !important;
        border-radius: 6px !important;
        padding: 2px !important;
        direction: rtl;
       
        
    }
    </style>
    """,
    unsafe_allow_html=True
    )

    

 
    with open('test_css.css') as f:
        css = f.read()
    st.markdown(f'<style>{css}</style>', unsafe_allow_html=True)

    if 'my_word' not in st.session_state:
        
        st.session_state['my_word'] = random.choice(list(my_dict.keys()))
    # if 'my_nabza' not in st.session_state:
    #     # my_nabza = st.session_state.get("my_word")
    #    st.session_state['my_nabza']  = my_dict[st.session_state['my_word']]
    #     # st.session_state['my_nabza'] =  my_dict["my_word"]
    nabza = my_dict[st.session_state['my_word']]
    n= len(st.session_state['my_word'])

    if 't' not in st.session_state:
        st.session_state['t'] = n+3

    if "user_input" not in st.session_state:
        st.session_state.user_input = ""
    def submit():
        st.session_state.user_input = st.session_state.widget
        st.session_state.widget = ""
    st.markdown(f'<p class="big-title">مرحبا بك فى لعبة استنتاج اسم سورة من سور الٌقرآن الكريم</p>', unsafe_allow_html=True)
    
    col1, col2 , col3= st.columns(3)
    
    with col2:
        st.image("moshaf20.jpg")

    col_left_spacer, col_middle_content, col_right_spacer = st.columns([1,2,1])

    with col_middle_content:
        
        col_icon, col_text = st.columns([0.05, 0.95],vertical_alignment="center")

        with col_icon:
            st.markdown(
                """
                
                <div class="help-icon">ℹ️
                <div class="help-text">
                        ادخل حرفا واحدا ثم اضغط اضافة<br>
                    اذا كان الحرف ضمن اسم السورة سيظهر فى مكانه ، واذا لم يكن من ضمن حروفها لايظهر.<br>
                       استمر فى ادخال الحروف والضغط على اضافة حتى تكتمل حروف السورة ويظهر اسمها كاملا.<br>
                       اذا كان حرف الألف بالهمزة أدخله صحيحا أ أو إ أو آ.<br>
                       بعد عدد معين من المحاولات اذا تم استنتاج اسم السورة كاملا ستفوز وتظهر لك رسالة الفوز ، واذا لم يتم الوصول إلى الاسم الصحيح ستخسر وتظهر لك رسالة الخسارة مع ظهور اسم السورة. 
                </div>
                </div>
                
                


                
                """,
                unsafe_allow_html=True
            )

        with col_text:
            st.markdown(
                """
                
                <div class="body-text">
                <b>استنتج اسم السورة بالحروف</b><br>
                       
                </div>

                    
                

               
                """,
                unsafe_allow_html=True
            )

    
   
    
    #st.markdown(f'<p class="custom-markdown">استنتج اسم السورة بالحروف </p>', unsafe_allow_html=True,help=help_text)
    st.markdown(f'<p class="custom-markdown"> السورة مكونة من : {n} حرف</p>', unsafe_allow_html=True)
    st.markdown(f'<p class="custom-markdown">{nabza}</p>', unsafe_allow_html=True)
    #st.markdown(f'<p class="custom-markdown">استنتج اسم السورة بالحروف , السورة مكونة من : {n} حرف</p>', unsafe_allow_html=True,help="ادخل حرفا واحدا ثم اضغط على أضف ،إذا كا الحرف من ضمن حروف السورة سيظهر الحرف فى مكانه وأذا لم يكن من ضمن حروف السورة لن يظهر ، استمر فى ادخال الحروف والضغط على أضف حتى يكتمل اسم السورة ،اذا كان حرف الألف بالهمزة فيجب ادخاله بالهمزة الصحيحة أ أو إ أو آ ، يساعدك على الاستنتاج عدد حروف السورة والنبذة المختصرة")
    
    st.text_input("ادخل حرف واحد :", key="widget" , on_change=submit)
    
    if 'my_lst' not in st.session_state:
        st.session_state['my_lst'] = []
        
    for i in range(len(st.session_state['my_word'])):
        st.session_state['my_lst'].append('-')
    
    #st.session_state['my_lst']
    #st.text(f"the word is {''.join(st.session_state['my_lst'][:n])}")
    
    user_input = st.session_state.user_input
    add_button = st.button("اضافة", key='add_button')
    if add_button:
        #ts = st.session_state.t
        #st.markdown(f'<p class="center-text">{ts}</p>', unsafe_allow_html=True)
        for j in range(len(st.session_state['my_word'])):
                if st.session_state['my_word'][j]==user_input.lower():
                    st.session_state['my_lst'][j]=user_input.lower()
                
        #st.text(''.join(st.session_state['my_lst'][:n]))
        st.markdown(f'<p class="user-word"> {"".join(st.session_state["my_lst"][:n])} </p>', unsafe_allow_html=True)

        if (st.session_state.t== 0) and (''.join(st.session_state['my_lst'][:n]) == st.session_state['my_word']):# for last trial
            st.success("لقد فزت 👍👏", icon="✅")
            play_no()
            # col1, col2 = st.columns([1,1])
            # with col1:
            #     st.button('play again', on_click=clearing)
            # with col2:
            #     st.button('NO, Thanks', on_click=stopping)
        elif(st.session_state.t== 0) and (''.join(st.session_state['my_lst'][:n]) != st.session_state['my_word']):# only case to loose
            st.error(f"لقد خسرت 😌.. اسم السورة هو:     {st.session_state['my_word']}")
            play_no()
            # col1, col2 = st.columns([1,1])
            # with col1:
            #     st.button('play again', on_click=clearing)
            # with col2:
            #     st.button('NO, Thanks', on_click=stopping)
        if st.session_state.t > 0:
            # if st.session_state.t in [1,2,3]:
            #     st.warning(f"you have {st.session_state.t} trials")
            
        
            if ''.join(st.session_state['my_lst'][:n]) == st.session_state['my_word']:
                st.success("لقد فزت 👍👏", icon="✅")
                st.session_state.t=0 # to stop compare
                play_no()
            if st.session_state.t in [1,2,3]:
                st.warning(f"لديك {st.session_state.t} محاولات")
        st.session_state.t= st.session_state.t-1
    #hanan
    else:
        
        st.markdown(f'<p class="user-word"> {"".join(st.session_state["my_lst"][:n])} </p>', unsafe_allow_html=True)
    #hanan



                

                
        
    

if __name__ == '__main__':
    my_dict = {'الفاتحة': 'سورة مكية تسمى السبع المثانى والكافية', 'البقرة': 'سورة مدنية من سور الطول تبدأ بحروف مقطعة', 'آل عمران': 'سورة مدنية من سور الطول تبدأ بحروف مقطعة', 'النساء': 'سورة مكية من سور الطول وتتحدث عن أحكام المواريث', 'المائدة': 'سورة مدنية من سور الطول تتحدث عن إحدى معجزات سيدنا عيسى الى قومه', 'الأنعام': 'سورة مكية من سور الطول تبدأ بأحد أساليب الثناء', 'الأعراف': 'سورة مكية من سور الطول تبدأ بحروف مقطعة', 'الأنفال': 'سورة مدنية من سور المثانى تبدأ بفعل ماضى', 'التوبة': 'سورة مدينة تسمى البراءة', 'يونس': 'سورة مكية من سور المئين تبدأ بحروف مقطعة اسمها من اسم نبى', 'هود': 'سورة مكية من سور المئين تبدأ بحروف مقطعة اسمها من اسم نبى', 'يوسف': 'سورة مكية من سور المئين تبدأ بحروف مقطعة اسمها من اسم نبى ذكر اسمه فى السورة  اكثر من 25 مرة', 'الرعد': 'سورة مدنية من المثانى تبدأ بحروف مقطعة تتحدث عن ظاهرة كونية ', 'ابراهيم': 'سورة مكية من المثانى تبدأ بحروف مقطعة سميت على اسم نبى حطم الأصنام', 'الحجر': 'سورة مكية من المثانى تبدأ بحروف مقطعة ', 'النحل': 'سورة مكية من المئين تبدأ بفعل ماضى ', 'الإسراء': 'سورة مكية من سور المئين تبدأ بأحد أساليب الثناء واسمها  معجزة خصها الله لنبيه', 'الكهف': 'سورة مكية من سور المئين تبدأ بأحد أساليب الثناء وتحكى عن أنواع من الفتن', 'مريم': 'سورة مكية من المثانى تبدأ بحروف مقطعة وسميت باسم امرأة', 'طه': 'سورة مكية من المثانى تبدأ بحروف مقطعة', 'الأنبياء': 'سورة مكية من سور المئين تبدأ بفعل ماضى', 'الحج': 'سورة مدنية من المثانى تبدأ باسلوب نداء للناس أجمعين ', 'المؤمنون': 'سورة مكية من سور المئين تبدأ بأسلوب توكيد', 'النور': 'سورة مدنية من المثانى تحدثت عن حادثة الإفك', 'الفرقان': 'سورة مكية من المثانى اسمها من أسماء القرآن', 'الشعراء': ' سورة مكية من سور المئين تسمى بالجامعة', 'النمل': 'سورة مكية من المثانى ذكرت فيها البسملة مرتين', 'القصص': 'سورة مكية من المثانى تحكى قصة سيدنا موسى كاملة', 'العنكبوت': 'سورة مكية من المثانى اسمها اسم كائن حى', 'الروم': 'سورة مكية من المثانى تحكى عن هزيمة امبراطورية', 'لقمان': 'سورة مكية من المثانى تبين فضل الحكمة ومكارم الأخلاق', 'السجدة': 'سورة مكية من المثانى يبكى الشيطان عند سماعها', 'الأحزاب': 'سورة مدنية من المثانى تبدأ باسلوب نداء للنبى', 'سبإ': 'سورة مكية من المثانى تحكى عن ملوك اليمن', 'فاطر': 'سورة مكية من المثانى تلقب بالملائكة', 'يس': 'سورة مكية من المثانى توصف بقلب القرآن', 'الصافات': ' سورة مكية من سور المئين وفيها قسم بالملائكة', 'ص': 'سورة مكية من المثانى تبدأ بحروف مقطعة', 'الزمر': 'سورة مكية من المثانى تسمى بسورة الغرف', 'غافر': 'سورة مكية من المثانى تسمى بسورة المؤمن', 'فصلت': 'سورة مكية من المثانى من الحواميم', 'الشورى': 'سورة مكية من المثانى تسمى بسورة عسق', 'الزخرف': 'سورة مكية من المثانى من الحواميم', 'الدخان': 'سورة مكية من المثانى من الحواميم', 'الجاثية': 'سورة مكية من المثانى وتسمى بالشريعة', 'الأحقاف': 'سورة مكية من المثانى من الحواميم', 'محمد': 'سورة مدنية من المثانى محورها الجهاد فى سبيل الله وتسمى سورة القتال', 'الفتح': 'سورة مدنية من المثانى نزلت بمناسبة صلح الحديبية ', 'الحجرات': 'سورة مدنية من المثانى تعلم الناس الآداب والأخلاق', 'ق': 'سورة مكية من المفصلات تسمى الباسقات', 'الذاريات': 'سورة مكية من المفصلات تبدأ بقسم', 'الطور': 'سورة مكية من المفصلات تبدأ بقسم', 'النجم': 'سورة مكية من المفصلات تبدأ بقسم', 'القمر': 'سورة مكية من المفصلات تبدأ بفعل ماضى', 'الرحمن': 'سورة مدنية من المفصلات تبدأ باسم من أسماء الله الحسنى', 'الواقعة': 'سورة مكية من المفصلات تبدأ باسلوب شرط', 'الحديد': 'سورة مدنية من المفصلات ومن المسبحات', 'المجادلة': 'سورة مدنية من المفصلات تسمى سورة الظهار', 'الحشر': 'سورة مدنية من المفصلات ومن المسبحات', 'الممتحنة': 'سورة مدنية من المفصلات ', 'الصف': 'سورة مدنية من المفصلات ومن المسبحات', 'الجمعة': 'سورة مدنية من المفصلات', 'المنافقون': 'سورة مدنية من المفصلات تبدأ باسلوب شرط', 'التغابن': 'سورة مدنية من المفصلات اسمها من أسماء يوم القيامة', 'الطلاق': 'سورة مدنية من المفصلات وتسمى بسورة النساء الصغرى', 'التحريم': 'سورة مدنية من المفصلات تبدأ باسلوب نداء', 'الملك': 'سورة مكية من المفصلات تسمى بالمنجية', 'القلم': 'سورة مكية من المفصلات تبدأ بقسم', 'الحاقة': 'سورة مكية من المفصلات اسمها من أسماء يوم القيامة', 'المعارج': 'سورة مكية من المفصلات تبدأ بفعل ماضى', 'نوح': 'سورة مكية من المفصلات تسمى بانا أرسلنا', 'الجن': 'سورة مكية من المفصلات تبدأ بفعل أمر', 'المزمل': 'سورة مكية من المفصلات تبدأ باسلوب نداء', 'المدثر': 'سورة مكية من المفصلات تبدأ باسلوب نداء', 'القيامة': 'سورة مكية من المفصلات تبدا بقسم', 'الانسان': 'سورة مدنية من المفصلات تبدا باستفهام', 'المرسلات': 'سورة مكية من المفصلات تبدأ بقسم', 'النبإ': 'سورة مكية من المفصلات تبدأ باسلوب استفهام', 'النازعات': 'سورة مكية من المفصلات تبدأ بقسم وتسمى بالساهرة', 'عبس': 'سورة مكية من المفصلات تبدأ بفعل ماضى', 'التكوير': 'سورة مكية من المفصلات تبدأ باسلوب شرط', 'الإنفطار': 'سورة مكية من المفصلات تبدأ باسلوب شرط', 'المطففين': 'سورة مكية من المفصلات تتحدث عن الغش', 'الإنشقاق': 'سورة مكية من المفصلات تبدأ باسلوب شرط', 'البروج': 'سورة مكية من المفصلات تبدأ بقسم', 'الطارق': 'سورة مكية من المفصلات تبدأ بقسم', 'الأعلى': 'سورة مكية من المفصلات بدأت بفعل امر', 'الغاشية': 'سورة مكية من المفصلات تبدأ باسلوب استفهام', 'الفجر': 'سورة مكية من المفصلات تبدأ بقسم', 'البلد': 'سورة مكية من المفصلات وتسمى بالعقبة', 'الشمس': 'سورة مكية من المفصلات تبدأ باسلوب شرط', 'الليل': 'سورة مكية من المفصلات تبدأ بقسم', 'الضحى': 'سورة مكية من المفصلات تبدأ بقسم', 'الشرح': 'سورة مكية من المفصلات وتسمى بسورة اليسر', 'التين': 'سورة مكية من المفصلات تبدأ بقسم', 'العلق': 'سورة مكية من المفصلات بدأت بفعل امر', 'القدر': 'سورة مكية من المفصلات تتحدث عن فضل أعظم ليلة', 'البينة': 'سورة مدنية من المفصلات تسمى سورة البرية', 'الزلزلة': 'سورة مدنية من المفصلات تبدأ باسلوب شرط', 'العاديات': 'سورة مكية من المفصلات تبدأ بقسم', 'القارعة': 'سورة مكية من المفصلات من أسماء يوم القيامة', 'التكاثر': 'سورة مكية من المفصلات وتسمى بالمقبرة', 'العصر': 'سورة مكية من المفصلات تبدأ بقسم', 'الهمزة': 'سورة مكية من المفصلات وتسمى بالحطمة', 'الفيل': 'سورة مكية من المفصلات تبدأ باسلوب استفهام', 'قريش': 'سورة مكية من المفصلات ', 'الماعون': 'سورة مكية من المفصلات تبدأ باسلوب استفهام', 'الكوثر': 'سورة مكية من المفصلات وهى أقصر سورة فى القرآن', 'الكافرون': 'سورة مكية من المفصلات تبدأ بفعل أمر', 'النصر': 'سورة مدنية من المفصلات وتسمى بالتوديع', 'المسد': 'سورة مكية من المفصلات وتسمى بتبت', 'الإخلاص': 'سورة مكية من المفصلات وتسمى بالتوحيد', 'الفلق': 'سورة من المعوذتين', 'الناس': 'سورة من المعوذتين'}
    # data=['orange' , 'banana' , 'apple', 'watermelon','mango','apricot','cherry','strawberry','dates','pears','fig','grapes']
    
    word(my_dict)